/*
*Создайте переменную, присвойте ей целочисленное значение. Выведите значение на экран
 */

public class Second {
    public static void main(String[] args) {
        int a = 10;
        System.out.println("a="+a);
    }
}
